README.org
#+PROPERTY: header-args :tangle yes :noweb yes :results silent

* Introduction
Hi there! That's my dotfiles.

This repository contains configuration for three hosts:
- omicron — my main laptop which runs NixOS
- pie — my home server RPi running NixOS (see [[./pie.org][pie.org]])
- AlexeyShmalko — my work laptop running Ubuntu (ugh, corporate policies) with home-manager on top

Most of config files are generated by [[http://orgmode.org/worg/org-contrib/babel/][org-babel]] from org files in this repository (yes, including this very same ~README.org~). That's [[https://en.wikipedia.org/wiki/Literate_programming][literate programming]] applied to dotfiles.

This file contains Emacs configuration, NixOS configuration for omicron, and common home-manager configuration between omicron and AlexeyShmalko. (I try to keep repetition to minimum, but some is inevitable.)

[[./work.nix][work.nix]] file contains home-manager configuration specific for AlexeyShmalko.

[[./pie.org][pie.org]] is a separate NixOS config for pie host.

To generate actual nix files, you can open this file in Emacs, and execute =M-x org-babel-tangle=. Or from command line with the following command.

#+begin_src sh :tangle no
emacs README.org --batch -f org-babel-tangle
#+end_src

#+RESULTS:

Note that you need to patch org-babel to correctly generate configs (<<patch-ob-tangle>>)

I keep generated files in sync with org files (so this repo is a valid Nix Flake), but they are not worth looking at—you'll have much better time reading this doc instead.

Pieces not (yet) covered in org files are:
- scripts at =bin/=

* Table of Contents :TOC_3:
- [[#introduction][Introduction]]
- [[#top-level][Top-level]]
  - [[#flake][Flake]]
  - [[#stable-packages][Stable packages]]
  - [[#nixos][NixOS]]
  - [[#home-manager][Home manager]]
  - [[#packages][Packages]]
  - [[#overlays][Overlays]]
- [[#nixos-1][NixOS]]
  - [[#general][General]]
  - [[#re-expose-nixpkgs][Re-expose nixpkgs]]
  - [[#sandbox][Sandbox]]
  - [[#users][Users]]
  - [[#machines][Machines]]
    - [[#omicron][omicron]]
- [[#emacs][Emacs]]
  - [[#install-emacs][Install Emacs]]
  - [[#bootstrap-emacs-config][Bootstrap Emacs config]]
  - [[#patch-ob-tangle][Patch ob-tangle]]
  - [[#gc-hacks][GC hacks]]
  - [[#use-package][use-package]]
  - [[#package][package]]
  - [[#general-package][General (package)]]
  - [[#dont-clutter-system][Don't clutter system]]
  - [[#helpers][Helpers]]
  - [[#ivy][ivy]]
  - [[#smex][smex]]
  - [[#counsel][counsel]]
  - [[#avy][avy]]
  - [[#imenu--imenu-list][imenu / imenu-list]]
  - [[#wgrep][wgrep]]
  - [[#whitespace][whitespace]]
  - [[#whitespace-cleanup][whitespace-cleanup]]
  - [[#which-key][which-key]]
  - [[#google-translate][Google translate]]
  - [[#tab-bar-mode][tab-bar-mode]]
  - [[#highlight-current-line][Highlight current line]]
  - [[#scrolling][Scrolling]]
  - [[#visual-fill-column][visual-fill-column]]
  - [[#misc][Misc]]
- [[#environment][Environment]]
  - [[#exwm][EXWM]]
  - [[#window-management][Window management]]
  - [[#window-layout][Window layout]]
  - [[#screen-locking][Screen locking]]
    - [[#slock][Slock]]
    - [[#xss-lock][xss-lock]]
    - [[#exwm-integration][EXWM integration]]
  - [[#system-tray][System tray]]
  - [[#screenshots][Screenshots]]
  - [[#misc-1][Misc]]
- [[#input][Input]]
  - [[#keyboard][Keyboard]]
    - [[#workman][Workman]]
    - [[#keyboard-layout][Keyboard layout]]
    - [[#xkeymap][Xkeymap]]
    - [[#emacs-quail][Emacs quail]]
  - [[#mouse][Mouse]]
    - [[#python-listener][Python listener]]
    - [[#emacs-handler][Emacs handler]]
- [[#network][Network]]
  - [[#networkmanager][NetworkManager]]
  - [[#vpn][VPN]]
  - [[#ssh][SSH]]
    - [[#mosh][Mosh]]
  - [[#dnsmasq][dnsmasq]]
  - [[#firewall][Firewall]]
- [[#services][Services]]
  - [[#locate][Locate]]
  - [[#gitolite][Gitolite]]
  - [[#syncthing][Syncthing]]
  - [[#docker][Docker]]
  - [[#backup][Backup]]
  - [[#direnv--lorri][direnv + lorri]]
- [[#hardware][Hardware]]
  - [[#autorandr][Autorandr]]
  - [[#screen-brightness][Screen brightness]]
  - [[#redshift][Redshift]]
  - [[#pulseaudio][PulseAudio]]
  - [[#bluetooth][Bluetooth]]
  - [[#adb][ADB]]
  - [[#fwupd][fwupd]]
- [[#browsers][Browsers]]
  - [[#tridactyl][Tridactyl]]
  - [[#edit-text-in-browser][Edit text in browser]]
  - [[#online-banking][Online banking]]
- [[#evil-mode][Evil-mode]]
  - [[#general-1][General]]
  - [[#swap-k-and-j][Swap k and j]]
  - [[#evil-numbers][evil-numbers]]
  - [[#evil-collection][evil-collection]]
  - [[#evil-surrond][evil-surrond]]
  - [[#calc][calc]]
  - [[#evilify-compile-mode][Evilify compile mode]]
  - [[#evilify-minibuffer][Evilify minibuffer]]
  - [[#evilify-shell-mode][Evilify shell mode]]
  - [[#lispyville][lispyville]]
- [[#org-mode][Org-mode]]
  - [[#general-2][General]]
  - [[#drill][Drill]]
  - [[#todo][Todo]]
  - [[#clocking][Clocking]]
  - [[#capture][Capture]]
    - [[#org-capture-keybindings][org-capture keybindings]]
  - [[#capturing-images][Capturing images]]
  - [[#datetree][datetree]]
  - [[#cliplink][cliplink]]
  - [[#refile][Refile]]
    - [[#refiling-with-hydras][Refiling with hydras]]
    - [[#refile-last-but-before-archive][Refile last but *before* archive]]
  - [[#archive][Archive]]
  - [[#agenda][Agenda]]
    - [[#allow-next-projects-to-stuck][Allow NEXT projects to stuck]]
  - [[#babel][Babel]]
  - [[#latex-preview][Latex preview]]
  - [[#image-preview][Image preview]]
  - [[#export][Export]]
  - [[#crypt][Crypt]]
  - [[#habits][Habits]]
  - [[#adaptive-wrap][adaptive-wrap]]
  - [[#org-roam][org-roam]]
  - [[#org-ref][org-ref]]
  - [[#org-roam-bibtex][org-roam-bibtex]]
  - [[#toc-org][toc-org]]
  - [[#org-fc][org-fc]]
  - [[#org-fc-review-todos][org-fc review todos]]
  - [[#toggle-markupview][toggle markup/view]]
  - [[#evilify-org-mode][Evilify org-mode]]
- [[#mail-setup][Mail setup]]
  - [[#applications][Applications]]
  - [[#interface][Interface]]
  - [[#emacs-1][Emacs]]
- [[#applications-1][Applications]]
  - [[#gpg][GPG]]
  - [[#yubikey][Yubikey]]
  - [[#password-store][password-store]]
  - [[#kde-apps][KDE apps]]
  - [[#zathura][Zathura]]
  - [[#user-applications][User applications]]
- [[#development][Development]]
  - [[#vim][Vim]]
  - [[#terminal--shell][Terminal / shell]]
    - [[#rxvt-unicode][rxvt-unicode]]
    - [[#vterm][vterm]]
    - [[#fish][fish]]
    - [[#eshell][eshell]]
    - [[#tmux][tmux]]
    - [[#other-terminal-goodies][Other terminal goodies]]
  - [[#git][git]]
    - [[#git-config][git config]]
    - [[#magit][magit]]
    - [[#git-commit][git-commit]]
    - [[#diff-hl][diff-hl]]
  - [[#man-pages][Man pages]]
  - [[#emacs-2][Emacs]]
    - [[#use-spaces-for-indentation][Use spaces for indentation]]
    - [[#make-underscore-part-of-words][Make underscore part of words]]
    - [[#color-compilation-mode][Color compilation mode]]
    - [[#projectile][projectile]]
    - [[#company][company]]
    - [[#hippie-expand][Hippie expand]]
    - [[#flycheck][flycheck]]
    - [[#flycheck-inline][flycheck-inline]]
    - [[#electric-pair][electric-pair]]
    - [[#color-identifiers][Color identifiers]]
    - [[#dtrt-indent][dtrt-indent]]
    - [[#paren-face][paren-face]]
    - [[#lsp][LSP]]
    - [[#commenting][Commenting]]
    - [[#yasnippet][yasnippet]]
  - [[#languages][Languages]]
    - [[#emacs-lisp][Emacs lisp]]
    - [[#nix][Nix]]
    - [[#haskell][Haskell]]
    - [[#rust][Rust]]
    - [[#go][Go]]
    - [[#cc][C/C++]]
    - [[#cmake][CMake]]
    - [[#python][Python]]
    - [[#javascript][JavaScript]]
    - [[#typescript][Typescript]]
    - [[#vue][Vue]]
    - [[#web-mode][Web-mode]]
    - [[#clojurescript][Clojure(Script)]]
    - [[#racket][Racket]]
    - [[#groovy][Groovy]]
    - [[#kotlin][Kotlin]]
    - [[#forth][Forth]]
    - [[#lua][Lua]]
    - [[#ledger--hledger][Ledger / Hledger]]
    - [[#markdown][Markdown]]
    - [[#json][JSON]]
    - [[#yaml][YAML]]
    - [[#jinja2][Jinja2]]
    - [[#docker-1][Docker]]
    - [[#restclient][restclient]]
    - [[#terraform][terraform]]
    - [[#graphviz][graphviz]]
    - [[#protobuf][protobuf]]
    - [[#sql][SQL]]
    - [[#plantuml][PlantUML]]
  - [[#android][Android]]
- [[#look-and-feel][Look and Feel]]
  - [[#remove-the-clutter][Remove the clutter]]
  - [[#beacon-mode][beacon-mode]]
  - [[#fonts][Fonts]]
  - [[#custom-input-font][Custom Input font]]
  - [[#variable-pitch-fonts-in-org-mode][Variable-pitch fonts in org-mode]]
  - [[#hi-dpi][Hi-DPI]]
  - [[#color-theme][Color theme]]
  - [[#emacs-modeline][Emacs modeline]]
- [[#misc-2][Misc]]
  - [[#goto-config][goto config]]
  - [[#configure-path][Configure PATH]]

* Top-level
** Flake
This repository is nix flakes–compatible.

The following goes to ~flake.nix~ file.
#+begin_src nix :tangle flake.nix :noweb no-export :padline no
#
# This file is auto-generated from "README.org"
#
{
  description = "rasendubi's packages and NixOS/home-manager configurations";

  inputs = {
    nixpkgs = {
      type = "github";
      owner = "NixOS";
      repo = "nixpkgs";
      ref = "nixpkgs-unstable";
    };

    <<flake-inputs>>
  };

  outputs = { self, ... }@inputs:
    let
      # Flakes are evaluated hermetically, thus are unable to access
      # host environment (including looking up current system).
      #
      # That's why flakes must explicitly export sets for each system
      # supported.
      systems = ["x86_64-linux" "aarch64-linux"];

      # genAttrs applies f to all elements of a list of strings, and
      # returns an attrset { name -> result }
      #
      # Useful for generating sets for all systems or hosts.
      genAttrs = list: f: inputs.nixpkgs.lib.genAttrs list f;

      # Generate pkgs set for each system. This takes into account my
      # nixpkgs config (allowUnfree) and my overlays.
      pkgsBySystem =
        let mkPkgs = system: import inputs.nixpkgs {
              inherit system;
              overlays = self.overlays.${system};
              config = { allowUnfree = true; };
            };
        in genAttrs systems mkPkgs;

      # genHosts takes an attrset { name -> options } and calls mkHost
      # with options+name. The result is accumulated into an attrset
      # { name -> result }.
      #
      # Used in NixOS and Home Manager configurations.
      genHosts = hosts: mkHost:
        genAttrs (builtins.attrNames hosts) (name: mkHost ({ inherit name; } // hosts.${name}));

      # merges a list of attrsets into a single attrset
      mergeSections = inputs.nixpkgs.lib.foldr inputs.nixpkgs.lib.mergeAttrs {};

    in mergeSections [
      <<flake-outputs-nixos>>
      <<flake-outputs-home-manager>>
      <<flake-outputs-packages>>
      <<flake-outputs-overlays>>
    ];
}
#+end_src

Nix flakes are still an experimental feature, so you need the following in NixOS configuration to enable it.
#+name: nixos-section
#+begin_src nix
{
  nix = {
    package = pkgs.nixFlakes;
    extraOptions = ''
      experimental-features = nix-command flakes ca-references
    '';
  };
}
#+end_src

For non-NixOS system, install ~nixFlakes~ and put the following into =~/.config/nix/nix.conf=.
#+begin_src conf :tangle no
experimental-features = nix-command flakes ca-references
#+end_src

** Stable packages
For packages that are broken in nixpkgs-unstable, expose the latest stable channel as ~pkgs.stable~.

Add input:
#+name: flake-inputs
#+begin_src nix
nixpkgs-stable = {
  type = "github";
  owner = "NixOS";
  repo = "nixpkgs";
  ref = "nixos-20.03";
};
#+end_src

Add overlay:
#+name: flake-overlays
#+begin_src nix
(final: prev: {
  stable = import inputs.nixpkgs-stable {
    inherit system;
    overlays = self.overlays.${system};
    config = { allowUnfree = true; };
  };
})
#+end_src
** NixOS
Expose NixOS configurations.
#+name: flake-outputs-nixos
#+begin_src nix
(let
  nixosHosts = {
    omicron = { system = "x86_64-linux";  config = ./nixos-config.nix; };

    # pie uses a separate config as it is very different
    # from other hosts.
    pie =     { system = "aarch64-linux"; config = ./pie.nix; };
  };

  mkNixosConfiguration = { name, system, config }:
    let pkgs = pkgsBySystem.${system};
    in inputs.nixpkgs.lib.nixosSystem {
      inherit system;
      modules = [
        { nixpkgs = { inherit pkgs; }; }
        (import config)
      ];
      specialArgs = { inherit name inputs; };
    };

in {
  nixosConfigurations = genHosts nixosHosts mkNixosConfiguration;
})
#+end_src
** Home manager
Add home-manager to flake inputs.
#+name: flake-inputs
#+begin_src nix
home-manager = {
  type = "github";
  owner = "rycee";
  repo = "home-manager";
  ref = "master";
  inputs.nixpkgs.follows = "nixpkgs";
};
#+end_src

Expose home-manager configurations.
#+name: flake-outputs-home-manager
#+begin_src nix
(let
  homeManagerHosts = {
    AlexeyShmalko = {
      system = "x86_64-linux";
      config = ./work.nix;
      username = "rasen";
      homeDirectory = "/home/rasen";
    };
  };

  mkHomeManagerConfiguration = { system, name, config, username, homeDirectory }:
    let pkgs = pkgsBySystem.${system};
    in inputs.home-manager.lib.homeManagerConfiguration {
      inherit system pkgs username homeDirectory;
      configuration = { ... }: {
        nixpkgs.config.allowUnfree = true;
        nixpkgs.config.firefox.enableTridactylNative = true;
        nixpkgs.overlays = self.overlays.${system};
        imports = [
          self.lib.home-manager-common

          (import config)
        ];
      };
    };

in {
  # Re-export common home-manager configuration to be reused between
  # NixOS module and standalone home-manager config.
  lib.home-manager-common = { lib, pkgs, config, ... }: {
    imports = [
      <<home-manager-section>>
    ];
    home.stateVersion = "20.09";
  };
  homeManagerConfigurations = genHosts homeManagerHosts mkHomeManagerConfiguration;
})
#+end_src

Integrate home-manager module into NixOS.
#+name: nixos-section
#+begin_src nix
{
  imports = [inputs.home-manager.nixosModules.home-manager];
  home-manager = {
    useUserPackages = true;
    useGlobalPkgs = true;
    users.rasen = inputs.self.lib.home-manager-common;
  };
}
#+end_src

** Packages
Generate packages set for each supported system.
#+name: flake-outputs-packages
#+begin_src nix
(let
  mkPackages = system:
    let
      pkgs = pkgsBySystem.${system};
    in
      mergeSections [
        <<flake-packages>>
      ];

in {
  packages = genAttrs systems mkPackages;
})
#+end_src
** Overlays
Generate overlays for all supported systems.
#+name: flake-outputs-overlays
#+begin_src nix
(let
  mkOverlays = system: [
    # mix-in all local packages, so they are available as pkgs.${packages-name}
    (final: prev: self.packages.${system})

    <<flake-overlays>>
  ];
in {
  overlays = genAttrs systems mkOverlays;
})
#+end_src

~<<flake-overlays>>~ are defined elsewhere.
* NixOS
** General
I'm a [[http://nixos.org/][NixOS]] user. What's cool about it is that I can describe all my system configuration in one file (almost). I can execute a single command and have a system with the same software, system settings, etc.

An outline of configuration looks like this:

#+begin_src nix :tangle nixos-config.nix :noweb no-export :padline no
#
# This file is auto-generated from "README.org"
#
{ name, config, pkgs, lib, inputs, ... }:
let
  machine-config = lib.getAttr name {
    omicron = [
      <<machine-omicron>>
    ];
  };

in
{
  imports = [
    {
      nixpkgs.config.allowUnfree = true;

      # The NixOS release to be compatible with for stateful data such as databases.
      system.stateVersion = "19.09";
    }

    <<nixos-section>>
  ] ++ machine-config;
}
#+end_src

This =<<nixos-section>>= is replaced by other parts of this doc.

